{
  "fgts": {
    "title": "FGTS - Fundo de Garantia",
    "description": "Entenda a fundo o que é, como funciona o depósito mensal e as principais modalidades de saque do seu Fundo de Garantia por Tempo de Serviço.",
    "topics": {
      "o_que_e_fgts": {
        "title": "O que é o FGTS?",
        "content": "<p>O Fundo de Garantia do Tempo de Serviço (FGTS) é uma poupança compulsória constituída por depósitos mensais realizados pelo empregador em nome do empregado. Seu principal objetivo é proteger o trabalhador demitido sem justa causa, mas também pode ser utilizado em outras situações específicas, como a aquisição de moradia própria.</p><p class='mt-2'>O valor depositado <strong>não é descontado do salário</strong>, sendo uma obrigação exclusiva do empregador.</p>",
        "legal": "Base legal: Lei nº 8.036/90",
        "example": "Funciona como uma segurança financeira, garantindo recursos em momentos de transição de carreira ou para a realização de grandes projetos."
      },
      "deposito_mensal": {
        "title": "Depósito Mensal",
        "content": "<p>O empregador é obrigado a depositar, até o dia 20 de cada mês (conforme novas regras do FGTS Digital), o valor correspondente a <strong>8% do salário bruto</strong> do empregado em uma conta vinculada na Caixa Econômica Federal. Este percentual é de 2% para contratos de aprendizagem.</p>",
        "legal": "Base legal: Art. 15 da Lei nº 8.036/90",
        "example": "Para um salário bruto de R$ 3.500,00, o depósito mensal obrigatório do FGTS, feito pela empresa, será de R$ 280,00."
      },
      "saque_rescisao": {
        "title": "Saque-Rescisão",
        "content": "<p>Esta é a modalidade padrão de saque. Ao ser demitido <strong>sem justa causa</strong>, o trabalhador tem o direito de sacar o <strong>saldo integral</strong> de sua conta do FGTS. Além do saldo, o empregador deve pagar uma multa rescisória de 40% sobre o montante de todos os depósitos realizados durante o contrato de trabalho.</p>",
        "legal": "Base legal: Art. 18 e Art. 20, I da Lei nº 8.036/90",
        "example": "Se um trabalhador é demitido sem justa causa com um saldo de R$ 15.000,00 no FGTS, ele poderá sacar a totalidade dos R$ 15.000,00."
      },
      "multa_40": {
        "title": "Multa Rescisória de 40%",
        "content": "<p>A multa de 40% é uma indenização paga pelo empregador na demissão sem justa causa. Ela é calculada sobre <strong>todos os depósitos</strong> realizados na conta do FGTS durante o contrato, devidamente atualizados, e não apenas sobre o saldo final. O valor é depositado na conta do FGTS para ser sacado juntamente com o saldo principal.</p>",
        "legal": "Base legal: Art. 18, § 1º da Lei nº 8.036/90",
        "example": "Se o total depositado durante o contrato foi de R$ 20.000,00, a multa rescisória a ser paga pelo empregador será de R$ 8.000,00."
      },
      "saque_aniversario": {
        "title": "Saque-Aniversário",
        "content": "<p>É uma modalidade <strong>opcional</strong> que permite ao trabalhador retirar parte do saldo do FGTS anualmente, no mês de seu aniversário. Em contrapartida, ao optar por este sistema, o trabalhador <strong>perde o direito ao saque integral</strong> do saldo em caso de demissão sem justa causa, mantendo apenas o direito à multa de 40%.</p>",
        "legal": "Base legal: Lei nº 13.932/2019",
        "example": "Um trabalhador que opta pelo saque-aniversário e é demitido sem justa causa poderá sacar apenas o valor da multa de 40%, mas não o saldo remanescente na conta."
      }
    }
  },
  "pisPasep": {
    "title": "Abono Salarial (PIS/PASEP)",
    "description": "O Abono Salarial é um benefício anual, no valor máximo de um salário mínimo, destinado a trabalhadores que satisfazem critérios específicos definidos em lei. A hermenêutica do direito exige o cumprimento de todos os requisitos de forma cumulativa.",
    "fundamentacao_legal": "<p>Regido pela Lei nº 7.998/90, o direito ao abono salarial exige que o trabalhador atenda a <strong>cinco requisitos</strong>:</p><p>1. Estar cadastrado no PIS/PASEP há pelo menos <strong>cinco anos</strong>.</p><p>2. Ter recebido remuneração média de até <strong>dois salários mínimos</strong> durante o ano-base.</p><p>3. Ter exercido atividade remunerada para Pessoa Jurídica, durante pelo menos <strong>30 dias</strong>, consecutivos ou não, no ano-base considerado para apuração.</p><p>4. Ter seus dados informados corretamente pelo empregador na Relação Anual de Informações Sociais (RAIS) ou no eSocial.</p><p class='mt-2'>O valor do abono é <strong>proporcional</strong> ao número de meses trabalhados no ano-base, onde cada mês equivale a 1/12 do salário mínimo vigente na data do pagamento.</p>",
    "constants": {
      "SALARIO_MINIMO_VIGENTE": 1518.00,
      "MAX_MULTIPLIER_SALARIO": 2,
      "MIN_ANOS_INSCRICAO": 5
    },
    "examples": [
      {
        "description": "Exemplo de cálculo para trabalhador elegível com 10 meses trabalhados.",
        "inputs": {
          "salario_medio_anobase": 1500.00,
          "meses_trabalhados_anobase": 10,
          "ano_inscricao": 2018
        },
        "expected_output": {
          "valor_abono": 1176.67,
          "elegivel": true
        }
      }
    ]
  },
  "seguroDesemprego": {
    "title": "Seguro-Desemprego",
    "description": "Benefício que provê assistência financeira temporária ao trabalhador dispensado involuntariamente (sem justa causa).",
    "fundamentacao_legal": "<p>Regulamentado pela Lei nº 7.998/90 e resoluções do CODEFAT, o Seguro-Desemprego é um pilar da seguridade social. Para ter direito, o trabalhador deve ter sido dispensado sem justa causa, não possuir renda própria para seu sustento e não estar recebendo benefício previdenciário de prestação continuada (exceto pensão por morte ou auxílio-acidente).</p><p class='mt-2'>A quantidade de parcelas e o tempo de trabalho exigido (carência) variam conforme o número de vezes que o benefício foi solicitado:</p><p><strong>1ª Solicitação:</strong> Ter trabalhado por pelo menos 12 meses nos últimos 18 meses.</p><p><strong>2ª Solicitação:</strong> Ter trabalhado por pelo menos 9 meses nos últimos 12 meses.</p><p><strong>3ª Solicitação em diante:</strong> Ter trabalhado nos 6 meses imediatamente anteriores.</p><p class='mt-2'>O valor do benefício é calculado com base na média dos salários dos últimos 3 meses anteriores à dispensa, conforme faixas de valores estipuladas pelo governo.</p>",
    "constants": {
      "SALARIO_MINIMO_VIGENTE": 1518.00,
      "TETO_SEGURO_DESEMPREGO": 2309.13
    },
    "tables": {
      "valores_parcelas": [
        { "faixa": { "min": 0, "max": 2041.39 }, "percentual": 0.80, "parcela_deduzir": 0 },
        { "faixa": { "min": 2041.40, "max": 3402.65 }, "percentual": 0.50, "parcela_deduzir": 1633.11 },
        { "faixa": { "min": 3402.66, "max": 99999999 }, "percentual": 0, "parcela_deduzir": 0, "teto_aplicado": true }
      ],
      "numero_parcelas": [
        { "solicitacao": 1, "meses_trabalhados": { "min": 12, "max": 23 }, "parcelas": 4 },
        { "solicitacao": 1, "meses_trabalhados": { "min": 24, "max": 99999999 }, "parcelas": 5 },
        { "solicitacao": 2, "meses_trabalhados": { "min": 9, "max": 23 }, "parcelas": 3 },
        { "solicitacao": 2, "meses_trabalhados": { "min": 24, "max": 99999999 }, "parcelas": 4 },
        { "solicitacao": 3, "meses_trabalhados": { "min": 6, "max": 11 }, "parcelas": 3 },
        { "solicitacao": 3, "meses_trabalhados": { "min": 12, "max": 23 }, "parcelas": 4 },
        { "solicitacao": 3, "meses_trabalhados": { "min": 24, "max": 99999999 }, "parcelas": 5 }
      ]
    }
  },
  "horasExtras": {
    "title": "Cálculo de Horas Extras",
    "description": "Compreenda a sistemática de cálculo das horas trabalhadas além da jornada normal, incluindo os adicionais e reflexos legais.",
    "fundamentacao_legal": "<p>A Constituição Federal (Art. 7º, XVI) e a CLT (Art. 59) garantem a remuneração superior para o serviço extraordinário. O cálculo parte do valor da hora normal, que é acrescida de um adicional.</p><p><strong>Adicionais Mínimos:</strong></p><p>• <strong>50%</strong> para horas extras prestadas de segunda a sábado.</p><p>• <strong>100%</strong> para horas extras prestadas em domingos e feriados.</p><p class='mt-2'><strong>Reflexo no DSR:</strong> As horas extras habitualmente prestadas integram o salário para todos os efeitos legais, gerando reflexos no cálculo do Descanso Semanal Remunerado (DSR), férias, 13º salário, aviso prévio e FGTS. A hermenêutica consolidada pelo TST (Súmula nº 172) determina que o valor das horas extras deve ser somado ao DSR.</p>",
    "constants": {
      "PERCENTUAL_HE_50": 0.5,
      "PERCENTUAL_HE_100": 1,
      "PERCENTUAL_ADICIONAL_NOTURNO": 0.2,
      "HORAS_MENSAIS_PADRAO": 220
    },
    "examples": []
  },
  "inss": {
    "title": "Contribuição Previdenciária (INSS)",
    "description": "Desconto mensal obrigatório que garante ao trabalhador o direito a benefícios da Previdência Social.",
    "fundamentacao_legal": "<p>Prevista na Lei nº 8.212/91, a contribuição ao INSS é fundamental para o custeio de aposentadorias, auxílios e pensões. O cálculo é feito de forma <strong>progressiva</strong>, ou seja, as alíquotas são aplicadas sobre cada faixa do salário de contribuição, e não de forma única sobre o total.</p><p class='mt-2'>Isso significa que o salário é 'fatiado' e cada fatia paga a alíquota correspondente. As faixas e alíquotas são atualizadas anualmente por portaria do Governo Federal. Existe um teto de contribuição, de modo que salários acima desse teto contribuem apenas até o limite estabelecido.</p>",
    "constants": {
      "TETO_CONTRIBUICAO_INSS_VALOR_REAL": 908.85
    },
    "tables": {
      "aliquotas_progressivas": [
        { "faixa": { "min": 0, "max": 1518.00 }, "aliquota": 0.075, "parcela_deduzir": 0 },
        { "faixa": { "min": 1518.01, "max": 2793.88 }, "aliquota": 0.09, "parcela_deduzir": 22.77 },
        { "faixa": { "min": 2793.89, "max": 4190.83 }, "aliquota": 0.12, "parcela_deduzir": 106.54 },
        { "faixa": { "min": 4190.84, "max": 8157.41 }, "aliquota": 0.14, "parcela_deduzir": 190.16 }
      ]
    }
  },
  "valeTransporte": {
    "title": "Cálculo do Vale-Transporte",
    "description": "Entenda a regra de custeio do benefício de transporte e como funciona o desconto no salário do empregado.",
    "fundamentacao_legal": "<p>Instituído pela Lei nº 7.418/85, o Vale-Transporte é uma obrigação do empregador de antecipar ao empregado os valores para seu deslocamento residência-trabalho-residência. A hermenêutica da lei define uma co-participação.</p><p class='mt-2'>A empresa é autorizada a descontar do empregado o valor de até <strong>6% do seu salário base</strong>. O valor que exceder esses 6% é de responsabilidade integral do empregador.</p><p><strong>Regra fundamental:</strong> O desconto é sempre o menor valor entre o custo total do transporte e o limite de 6% do salário. Se o custo do transporte for inferior a 6% do salário, o desconto será limitado a esse custo.</p>",
    "constants": {
      "PERCENTUAL_DESCONTO_SALARIO": 0.06,
      "DIAS_UTEIS_PADRAO": 22
    }
  },
  "irrf": {
    "title": "Imposto de Renda Retido na Fonte (IRRF)",
    "description": "Antencipação do Imposto de Renda devido anualmente, descontado diretamente na folha de pagamento.",
    "fundamentacao_legal": "<p>Regido pela Lei nº 7.713/88 e regulamentado pela Receita Federal, o IRRF incide sobre o rendimento tributável do trabalhador. A correta interpretação da base de cálculo é crucial.</p><p><strong>Base de Cálculo:</strong> Salário Bruto (-) Contribuição ao INSS (-) Deduções por Dependentes Legais.</p><p class='mt-2'>Sobre essa base, aplica-se uma tabela com alíquotas <strong>progressivas</strong> (de 0% a 27,5%). Assim como no INSS, o cálculo é feito por faixas. Do imposto apurado, subtrai-se uma 'parcela a deduzir' correspondente à faixa de alíquota, resultando no valor final a ser retido na fonte.</p>"
  },
  "irpf": {
    "title": "Imposto de Renda (IRPF) - Ajuste Anual",
    "fundamentacao_legal": "Cálculo do Imposto de Renda Pessoa Física para o ajuste anual, baseado na Instrução Normativa RFB nº 2174 e Lei n° 14.848. O cálculo considera a renda tributável anual, deduções legais (dependentes, saúde, educação) e o imposto já retido na fonte para apurar o imposto a pagar ou a restituir.",
    "constants": {
      "DEDUCAO_POR_DEPENDENTE_ANUAL": 2275.08,
      "LIMITE_DESPESAS_EDUCACAO_ANUAL": 3561.50,
      "LIMITE_DESCONTO_SIMPLIFICADO_ANUAL": 16754.34
    },
    "tables": {
      "tabela_anual_2025": [
        { "faixa": { "min": 0, "max": 27110.40 }, "aliquota": 0, "parcela_deduzir": 0 },
        { "faixa": { "min": 27110.41, "max": 33919.80 }, "aliquota": 0.075, "parcela_deduzir": 2033.28 },
        { "faixa": { "min": 33919.81, "max": 45012.60 }, "aliquota": 0.15, "parcela_deduzir": 4577.27 },
        { "faixa": { "min": 45012.61, "max": 55976.16 }, "aliquota": 0.225, "parcela_deduzir": 7953.21 },
        { "faixa": { "min": 55976.17, "max": 999999999 }, "aliquota": 0.275, "parcela_deduzir": 10752.02 }
      ]
    }
  },
  "ferias": {
    "title": "Direito às Férias",
    "description": "Entenda seus direitos relacionados às férias, incluindo o cálculo e as modalidades.",
    "topics": {
      "direito_ferias": {
        "title": "O que são as Férias?",
        "content": "<p>As férias são um direito a <strong>30 dias</strong> de descanso remunerado, concedido ao empregado após cada período de 12 meses de trabalho, conhecido como 'período aquisitivo'.</p><p class='mt-2'>A empresa tem a obrigação de conceder as férias nos 12 meses seguintes ('período concessivo'). Caso esse prazo não seja cumprido, o empregador deverá pagar o valor correspondente às férias em dobro.</p>",
        "legal": "Base legal: Art. 129 e 137 da CLT",
        "example": "Um funcionário admitido em 01/01/2024 completa seu período aquisitivo em 31/12/2024. A empresa deve conceder suas férias até 31/12/2025."
      },
      "terco_constitucional": {
        "title": "O que é o Terço Constitucional de Férias?",
        "content": "<p>É um valor adicional, garantido pela Constituição, correspondente a <strong>1/3 do salário</strong> do empregado, que deve ser pago junto à remuneração das férias. O objetivo é proporcionar um recurso extra para o período de descanso.</p>",
        "legal": "Base legal: Art. 7º, XVII da Constituição Federal",
        "example": "Para um salário de R$ 3.000,00, a remuneração de férias será de R$ 3.000,00 + R$ 1.000,00 (1/3), totalizando R$ 4.000,00 brutos."
      },
      "abono_pecuniario": {
        "title": "O que é Abono Pecuniário?",
        "content": "<p>O abono pecuniário é a conversão de até <strong>1/3 dos dias de férias</strong> em dinheiro. Trata-se de uma faculdade do empregado, que pode optar por vender até 10 dias de seu descanso. O empregador não pode se opor a essa decisão.</p>",
        "legal": "Base legal: Art. 143 da CLT",
        "example": "Um empregado com direito a 30 dias de férias pode usufruir de 20 dias de descanso e receber o pagamento correspondente aos 10 dias restantes como abono."
      },
      "ferias_vencidas": {
        "title": "O que são Férias Vencidas?",
        "content": "<p>Ocorrem quando o empregador não concede as férias ao empregado dentro do prazo legal (período concessivo). Nessa situação, a legislação determina que o pagamento das férias seja feito <strong>em dobro</strong>, como forma de penalidade.</p>",
        "legal": "Base legal: Art. 137 da CLT",
        "example": "Se o período para concessão das férias terminou em março e a empresa não as concedeu, elas passam a ser consideradas vencidas e deverão ser pagas em dobro."
      }
    }
  },
  "decimo-terceiro": {
    "title": "13º Salário",
    "description": "Informações completas sobre o cálculo e o pagamento da gratificação natalina.",
    "topics": {
      "direito_decimo": {
        "title": "O que é o 13º Salário?",
        "content": "<p>A gratificação natalina, ou 13º salário, é um benefício que corresponde a <strong>1/12 da remuneração integral</strong> por mês de serviço no ano. O direito é adquirido a partir de 15 dias de trabalho no mês.</p><p class='mt-2'>O pagamento é tradicionalmente realizado em duas parcelas.</p>",
        "legal": "Base legal: Lei nº 4.090/62",
        "example": "Com um salário de R$ 3.000,00, um ano completo de trabalho resulta em um 13º de R$ 3.000,00. Seis meses de trabalho resultam em R$ 1.500,00."
      },
      "parcelas_decimo": {
        "title": "Como as Parcelas são Pagas?",
        "content": "<p><strong>1ª Parcela:</strong> Paga entre fevereiro e 30 de novembro, corresponde a 50% do salário bruto, sem incidência de descontos.</p><p class='mt-2'><strong>2ª Parcela:</strong> Paga até 20 de dezembro, corresponde aos 50% restantes, com a dedução do INSS e do IRRF calculados sobre o valor total do 13º salário.</p>",
        "legal": "Base legal: Lei nº 4.749/65",
        "example": "Para um 13º de R$ 3.000,00, a 1ª parcela é de R$ 1.500,00. A 2ª é de R$ 1.500,00 menos os descontos totais."
      },
      "adiantamento_13": {
        "title": "É possível adiantar o 13º Salário?",
        "content": "<p>Sim, o empregado pode solicitar o adiantamento da primeira parcela do 13º salário para recebê-la juntamente com suas férias. O pedido deve ser feito formalmente ao empregador no mês de janeiro do ano correspondente.</p>",
        "legal": "Base legal: Art. 2º da Lei nº 4.749/65",
        "example": "Ao tirar férias em julho, o empregado pode solicitar em janeiro o pagamento da primeira parcela do 13º junto com a remuneração das férias."
      }
    }
  },
  "rescisao": {
    "title": "Rescisão de Contrato",
    "description": "Conheça os direitos e as verbas rescisórias em cada modalidade de desligamento.",
    "topics": {
      "tipos_rescisao": {
        "title": "Modalidades de Rescisão e Direitos",
        "content": "<p><strong>Demissão sem justa causa:</strong> O empregado tem direito a todas as verbas rescisórias, incluindo saldo de salário, aviso prévio, 13º e férias proporcionais, saque do FGTS acrescido da multa de 40% e seguro-desemprego (se preenchidos os requisitos).</p><p><strong>Pedido de demissão:</strong> O empregado recebe saldo de salário, 13º e férias proporcionais. Não tem direito ao saque do FGTS, à multa de 40% e ao seguro-desemprego.</p><p><strong>Demissão por justa causa:</strong> O empregado perde a maior parte das verbas rescisórias, tendo direito apenas ao saldo de salário e às férias vencidas (se houver), acrescidas do terço constitucional.</p><p><strong>Acordo mútuo:</strong> O empregado recebe metade do aviso prévio (se indenizado) e metade da multa do FGTS (20%), além das demais verbas (saldo, 13º e férias). Permite o saque de 80% do saldo do FGTS, mas não dá direito ao seguro-desemprego.</p>",
        "legal": "Base legal: Arts. 477 a 486 da CLT",
        "example": "Na demissão sem justa causa, o cálculo rescisório é o mais completo para o trabalhador."
      },
      "aviso_previo": {
        "title": "O que é o Aviso Prévio?",
        "content": "<p>É a comunicação antecipada do término do contrato de trabalho. Pode ser <strong>trabalhado</strong>, com o cumprimento do período de atividade, ou <strong>indenizado</strong>, com o pagamento do valor correspondente e desligamento imediato.</p><p class='mt-2'>Sua duração é de 30 dias, com acréscimo de 3 dias por ano de serviço na mesma empresa, limitado a um total de 90 dias.</p>",
        "legal": "Base legal: Art. 487 da CLT e Lei nº 12.506/11",
        "example": "Um funcionário com 3 anos de empresa tem direito a 30 dias base + 9 dias adicionais, totalizando 39 dias de aviso prévio."
      },
      "multa_fgts": {
        "title": "Multa Rescisória do FGTS",
        "content": "<p>Na demissão sem justa causa, o empregador deve pagar uma multa de <strong>40% sobre o valor total</strong> depositado na conta do FGTS do empregado durante o contrato. Em caso de acordo mútuo, a multa é reduzida para <strong>20%</strong>.</p>",
        "legal": "Base legal: Art. 18 da Lei nº 8.036/90",
        "example": "Com um saldo de R$ 10.000,00 no FGTS, a multa em uma demissão sem justa causa será de R$ 4.000,00."
      },
      "seguro_desemprego": {
        "title": "Seguro-Desemprego",
        "content": "<p>É um benefício financeiro temporário concedido ao trabalhador dispensado sem justa causa. Os requisitos e o número de parcelas (de 3 a 5) dependem do tempo de serviço e de quantas vezes o benefício já foi solicitado anteriormente.</p>",
        "legal": "Base legal: Lei nº 7.998/90",
        "example": "Para a primeira solicitação, é necessário ter trabalhado por pelo menos 12 meses nos últimos 18 meses anteriores à data da dispensa."
      }
    }
  },
  "descontos": {
    "title": "Descontos em Folha de Pagamento",
    "description": "Compreenda os principais descontos legais que incidem sobre a remuneração.",
    "topics": {
      "inss": {
        "title": "Contribuição ao INSS",
        "content": "<p>A contribuição ao Instituto Nacional do Seguro Social (INSS) é um desconto obrigatório que garante ao trabalhador o acesso a benefícios previdenciários, como aposentadoria, auxílio-doença e pensão por morte.</p><p class='mt-2'>O cálculo é feito de forma <strong>progressiva</strong>, com alíquotas que variam de 7,5% a 14% aplicadas sobre cada faixa salarial.</p>",
        "legal": "Base legal: Lei nº 8.212/91",
        "example": "Para um salário de R$ 3.000,00, o desconto não é de uma alíquota única, mas sim da soma dos percentuais aplicados a cada faixa do valor."
      },
      "irrf": {
        "title": "Imposto de Renda Retido na Fonte (IRRF)",
        "content": "<p>O IRRF é um imposto federal que incide sobre a renda do trabalhador. Sua base de cálculo é o salário bruto menos a contribuição ao INSS e as deduções por dependentes legais.</p><p class='mt-2'>As alíquotas também são <strong>progressivas</strong> (de 7,5% a 27,5%), e cada faixa possui uma parcela a ser deduzida do imposto apurado.</p>",
        "legal": "Base legal: Lei nº 7.713/88",
        "example": "Um salário com base de cálculo de R$ 2.500,00 (após dedução do INSS) se enquadra em uma alíquota específica, gerando o imposto a ser retido."
      },
      "desconto_vt": {
        "title": "Desconto de Vale-Transporte",
        "content": "<p>A legislação permite que a empresa desconte até <strong>6% do salário base</strong> do empregado para custear o vale-transporte. Se o valor total do benefício for inferior a 6% do salário, o desconto será limitado ao custo real do transporte.</p>",
        "legal": "Base legal: Lei nº 7.418/85",
        "example": "Salário de R$ 3.000,00 (limite de 6% = R$ 180,00). Se o custo do VT for R$ 250,00, o desconto será de R$ 180,00. Se o custo for R$ 150,00, o desconto será de R$ 150,00."
      },
      "outros_descontos": {
        "title": "Outros Descontos Permitidos",
        "content": "<p>Outros descontos podem ocorrer, desde que autorizados pelo empregado ou previstos em acordo coletivo:</p><p><strong>Benefícios (VR, VA, Plano de Saúde):</strong> Conforme as regras do benefício e a legislação (PAT), com limites percentuais.</p><p><strong>Adiantamentos Salariais:</strong> Devolução de valores antecipados.</p><p><strong>Contribuição Sindical:</strong> Apenas com autorização expressa e prévia do empregado.</p>",
        "legal": "Base legal: Art. 462 e 579 da CLT",
        "example": "Um desconto de plano de saúde só pode ser realizado se houver previsão contratual e autorização do funcionário."
      }
    }
  },
  "adicionais": {
    "title": "Adicionais Salariais",
    "description": "Descubra os adicionais que compensam condições especiais de trabalho.",
    "topics": {
      "periculosidade": {
        "title": "Adicional de Periculosidade",
        "content": "<p>É um acréscimo de <strong>30% sobre o salário base</strong> (sem contar outras verbas) devido aos trabalhadores expostos a riscos acentuados, como contato com inflamáveis, explosivos, energia elétrica ou roubos.</p><p class='mt-2'><strong>Atenção:</strong> Este adicional não pode ser acumulado com o de insalubridade. O empregado deve optar pelo que lhe for mais vantajoso.</p>",
        "legal": "Base legal: Art. 193 da CLT",
        "example": "Para um salário base de R$ 3.000,00, o adicional de periculosidade corresponde a R$ 900,00."
      },
      "insalubridade": {
        "title": "Adicional de Insalubridade",
        "content": "<p>Compensação financeira para trabalhadores expostos a agentes nocivos à saúde acima dos limites de tolerância. Os percentuais incidem, em regra, sobre o salário mínimo e variam conforme o grau do risco:</p><p><strong>Mínimo:</strong> 10% | <strong>Médio:</strong> 20% | <strong>Máximo:</strong> 40%</p><p class='mt-2'><strong>Atenção:</strong> Não é acumulável com o adicional de periculosidade.</p>",
        "legal": "Base legal: Art. 192 da CLT",
        "example": "Em uma atividade de grau máximo (40%), o adicional calculado sobre o salário mínimo de R$ 1.412,00 seria de R$ 564,80."
      },
      "adicional_noturno": {
        "title": "Adicional Noturno",
        "content": "<p>Para o trabalho urbano realizado entre 22h e 5h, a remuneração deve ter um acréscimo de, no mínimo, <strong>20% sobre o valor da hora diurna</strong>. Além disso, a hora de trabalho noturna é computada como 52 minutos e 30 segundos (hora ficta), o que na prática aumenta o valor pago.</p>",
        "legal": "Base legal: Art. 73 da CLT",
        "example": "Se a hora normal é R$ 15,00, a hora noturna será de, no mínimo, R$ 18,00, além do ganho de tempo pela hora reduzida."
      },
      "horas_extras": {
        "title": "Horas Extras",
        "content": "<p>Toda hora trabalhada além da jornada contratual deve ser remunerada com um adicional. O valor mínimo é de <strong>50%</strong> para horas extras em dias úteis e de <strong>100%</strong> para as realizadas em domingos e feriados.</p>",
        "legal": "Base legal: Art. 59 da CLT e Art. 7º, XVI da CF",
        "example": "Se o valor da hora normal é R$ 15,00, a hora extra com 50% será de R$ 22,50."
      }
    }
  },
  "beneficios": {
    "title": "Benefícios Trabalhistas",
    "description": "Conheça os principais benefícios garantidos pela legislação ou por negociação coletiva.",
    "topics": {
      "salario_familia": {
        "title": "Salário-Família",
        "content": "<p>É um benefício previdenciário pago aos empregados de baixa renda, na proporção do número de filhos de até 14 anos ou filhos inválidos de qualquer idade. O valor da cota e o limite de renda são definidos anualmente pelo governo.</p><p class='mt-2'>Para 2024, o valor é de R$ 62,04 por filho para quem tem remuneração mensal de até R$ 1.819,26.</p>",
        "legal": "Base legal: Art. 65 da Lei nº 8.213/91",
        "example": "Um trabalhador elegível com dois filhos recebe R$ 124,08 mensais a título de salário-família."
      },
      "vale_transporte": {
        "title": "Vale-Transporte",
        "content": "<p>É um benefício obrigatório que o empregador deve antecipar para cobrir as despesas de deslocamento do empregado entre sua residência e o local de trabalho. A empresa pode descontar até 6% do salário base do funcionário para custear o benefício, arcando com o valor excedente.</p>",
        "legal": "Base legal: Lei nº 7.418/85",
        "example": "Se o custo de transporte é de R$ 200,00 e 6% do salário do empregado são R$ 150,00, a empresa arcará com os R$ 50,00 restantes."
      },
      "vale_refeicao": {
        "title": "Vale-Refeição/Alimentação",
        "content": "<p>Não é um benefício obrigatório por lei, mas frequentemente é concedido por meio de acordos ou convenções coletivas de trabalho. As regras de custeio e desconto variam, mas geralmente seguem as diretrizes do Programa de Alimentação do Trabalhador (PAT).</p>",
        "legal": "Base legal: Lei nº 6.321/76 e normas coletivas",
        "example": "Um acordo coletivo pode definir o valor diário do vale-refeição e o percentual máximo de desconto no salário do empregado."
      },
      "fgts_topic": {
        "title": "FGTS - Fundo de Garantia do Tempo de Serviço",
        "content": "<p>O empregador é obrigado a depositar mensalmente o valor correspondente a <strong>8% do salário bruto</strong> do empregado em uma conta vinculada em nome deste. O FGTS funciona como uma poupança compulsória que pode ser sacada em situações específicas, como demissão sem justa causa, aposentadoria ou compra de imóvel.</p>",
        "legal": "Base legal: Lei nº 8.036/90",
        "example": "Para um salário bruto de R$ 3.000,00, o depósito mensal no FGTS será de R$ 240,00."
      }
    }
  },
  "individual_topics": {
    "base_insalubridade": {
      "title": "Base de Cálculo do Adicional de Insalubridade",
      "content": "<p>A jurisprudência majoritária (Súmula Vinculante nº 4 do STF) e a CLT indicam o <strong>salário mínimo</strong> como base de cálculo. Contudo, a convenção ou acordo coletivo da categoria pode estabelecer o <strong>salário base</strong> ou o piso salarial como base, condição que, por ser mais benéfica ao trabalhador, deve prevalecer.</p>",
      "legal": "Base legal: Súmula Vinculante nº 4 do STF e Art. 192 da CLT"
    }
  }
}
